# int (целое число)
number = 30

# float (дробное число)
fnumber = 5.7

# str (тупа текст и только в КАВЫЧКАХ)
name = "Dero"

# bool (только статус true/false)
status = True

# вывод на экран (кавычки в кавычки либо 'одинарные' кавычки)
print ("он \"плохой\" человек")

# перенос строки (\n)
print ("Hello\nworld")

# Конкатенация (строка + переменная str)
print ("Привет меня зовут " + name + "!")

# Тайпкастинг (конвертация переменных inr в str и т.д)
print('Мне ' + str(number) + ' лет!')

# Окно ввода для пользователя (input окно ввода)

nickname = input( "Введите своё имя: ")
age = input( "Укажите свой возраст: ")
 
print('Привет, ' + nickname + '!')
print("Тебе уже " + age + "лет!")